tata5-1468250627282/gatling.txt
GATLING_HOME is set to /opt/gatling
18:24:42.580 [WARN ] i.g.c.ZincCompiler$ - Pruning sources from previous analysis, due to incompatible CompileSetup.
Simulation about login will begin
Simulation tai.matrix.RecordedSimulateloginFalse2 started...

================================================================================
2016-08-18 18:25:32                                           5s elapsed
---- Admin ---------------------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 2      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-08-18 18:25:37                                          10s elapsed
---- Admin ---------------------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 2      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-08-18 18:25:42                                          15s elapsed
---- Admin ---------------------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 2      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-08-18 18:25:47                                          20s elapsed
---- Admin ---------------------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 2      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-08-18 18:25:52                                          25s elapsed
---- Admin ---------------------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 2      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-08-18 18:25:57                                          30s elapsed
---- Admin ---------------------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 2      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-08-18 18:26:02                                          35s elapsed
---- Admin ---------------------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 2      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-08-18 18:26:07                                          40s elapsed
---- Admin ---------------------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 2      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-08-18 18:26:12                                          45s elapsed
---- Admin ---------------------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 2      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-08-18 18:26:17                                          50s elapsed
---- Admin ---------------------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 2      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-08-18 18:26:22                                          55s elapsed
---- Admin ---------------------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 2      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================


================================================================================
2016-08-18 18:26:27                                          60s elapsed
---- Admin ---------------------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 2      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=0     )

================================================================================

18:26:28.733 [WARN ] i.g.h.a.ResponseProcessor - Request 'Get' failed: j.u.c.TimeoutException: Request timeout to not-connected after 60000ms
18:26:28.748 [ERROR] i.g.h.a.s.HttpRequestAction - 'httpRequest-10' failed to execute: No attribute named 'url' is defined
18:26:30.669 [WARN ] i.g.h.a.ResponseProcessor - Request 'Get' failed: j.u.c.TimeoutException: Request timeout to not-connected after 60000ms
18:26:30.671 [ERROR] i.g.h.a.s.HttpRequestAction - 'httpRequest-10' failed to execute: No attribute named 'url' is defined

================================================================================
2016-08-18 18:26:32                                          65s elapsed
---- Admin ---------------------------------------------------------------------
[--------------------------------------------------------------------------]  0%
          waiting: 0      / active: 2      / done:0     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=2     )
> Get                                                      (OK=0      KO=2     )
---- Errors --------------------------------------------------------------------
> j.u.c.TimeoutException: Request timeout to not-connected after      2 (100.0%)
 60000ms
> Failed to build request Init: No attribute named 'url' is defi      2 (100.0%)
ned 
================================================================================

Fail
18:26:35.743 [ERROR] i.g.h.a.s.HttpRequestAction - 'httpRequest-2' failed to execute: No attribute named 'url' is defined

================================================================================
2016-08-18 18:26:37                                          70s elapsed
---- Admin ---------------------------------------------------------------------
[#####################################-------------------------------------] 50%
          waiting: 0      / active: 1      / done:1     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=2     )
> Get                                                      (OK=0      KO=2     )
---- Errors --------------------------------------------------------------------
> j.u.c.TimeoutException: Request timeout to not-connected after      2 (100.0%)
 60000ms
> Failed to build request Init: No attribute named 'url' is defi      2 (100.0%)
ned 
> Failed to build request login: No attribute named 'url' is def      1 (50.00%)
ined 
================================================================================

Fail
18:26:37.692 [ERROR] i.g.h.a.s.HttpRequestAction - 'httpRequest-2' failed to execute: No attribute named 'url' is defined

================================================================================
2016-08-18 18:26:37                                          70s elapsed
---- Admin ---------------------------------------------------------------------
[##########################################################################]100%
          waiting: 0      / active: 0      / done:2     
---- Requests ------------------------------------------------------------------
> Global                                                   (OK=0      KO=2     )
> Get                                                      (OK=0      KO=2     )
---- Errors --------------------------------------------------------------------
> j.u.c.TimeoutException: Request timeout to not-connected after      2 (100.0%)
 60000ms
> Failed to build request Init: No attribute named 'url' is defi      2 (100.0%)
ned 
> Failed to build request login: No attribute named 'url' is def      2 (100.0%)
ined 
================================================================================

Simulation tai.matrix.RecordedSimulateloginFalse2 completed in 69 seconds
Simulation about login is finished
Parsing log file(s)...
Parsing log file(s) done
Generating reports...

================================================================================
---- Global Information --------------------------------------------------------
> request count                                          2 (OK=0      KO=2     )
> min response time                                  60006 (OK=-      KO=60006 )
> max response time                                  60008 (OK=-      KO=60008 )
> mean response time                                 60007 (OK=-      KO=60007 )
> std deviation                                          1 (OK=-      KO=1     )
> response time 50th percentile                      60007 (OK=-      KO=60007 )
> response time 75th percentile                      60007 (OK=-      KO=60007 )
> response time 95th percentile                      60007 (OK=-      KO=60007 )
> response time 99th percentile                      60007 (OK=-      KO=60007 )
> mean requests/sec                                  0.029 (OK=-      KO=0.029 )
---- Response Time Distribution ------------------------------------------------
> t < 800 ms                                             0 (  0%)
> 800 ms < t < 1200 ms                                   0 (  0%)
> t > 1200 ms                                            0 (  0%)
> failed                                                 2 (100%)
---- Errors --------------------------------------------------------------------
> j.u.c.TimeoutException: Request timeout to not-connected after      2 (100.0%)
 60000ms
================================================================================

Reports generated in 0s.
Please open the following file: /opt/gatling/results/recordedsimulateloginfalse2-1471544727254/index.html
Global: max of response time is less than 50 : false
For all requests: count of failed requests is less than 5 : true
Could not find stats matching assertion path List(Login) : false